// Строгий режим
"use strict"

//Рішення домашнього завдання.
// задача № 1
 let someVar = 0;
 ++someVar;

if (someVar) {
	console.log(someVar);
}

//Відповідь: 1 , префіксний оператор збільшить нуль до 1, в перевірці if один це tru, виведе один.

// задача № 2

for(let i = 1; i <= 10; i++){
	console.log("Пункт № " + i)
}
// За допомогою циклу ітеруємо від 1 до 10 , виводимо результат, додаючі "Пункт № + i" при кожній ітерації.


//Задача №3
//Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}


// 1. 2 * 20 <= 10 - це false, оскільки 2 * 20 дорівнює 40, а 40 не менше 10.
// 2. 30 / 2 < 5 - це false, оскільки 30 / 2 дорівнює 15, а 15 не менше 5.
// 3. 10 <= "10" - це true, оскільки порівнювання рядка з числом перетворює рядок у число, і 10 дорівнює 10.
// 4. 20 === "20" - це false, оскільки строге порівняння.
/*
false || false && true || false
false || (false && true) || false
false || false || false
Відповідь: у консоль нічого не потратить оскульки значення  false не виконує умови if. 
*/


//Задача №4
function calcSum(a,b) {
	if (a === undefined || b === undefined || isNaN(a) || isNaN(b) || b === 0) {
		return "Помилка: Некоректні аргументи для ділення";
  }

	let x = a / b;
	
	return "Результат ділення: " + x;
	
}

console.log(calcSum(30,10))


//Задача №5

const myArray = [7, "world", "green", 10, "10"];
myArray.forEach(function(i, index){
	if (i == 10) {
		 console.log(`Елемент з індексом ${index} має значення 10.`);
	}
});


